blogs.org
#+HUGO_BASE_DIR: ~/Projects/blog/
#+HUGO_SECTION: posts
#+HUGO_AUTO_SET_LASTMOD: t
#+STARTUP: indent logdrawer

** DONE Indrew                                                     :Fiction:
CLOSED: [2024-04-29 Mon 18:12]
:PROPERTIES:
:EXPORT_FILE_NAME: rewind
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :description 一切有为法，如梦幻泡影，如露亦如电，应作如是观。
:END:

*** I

浑身动弹不得，本能驱使下的不断挣扎，也只让呼吸愈发困难。

缓慢地吸一口气，收集来自身体各处的感受，似乎是被拘束带捆在钢架床上。

/这是……精神病院？/

极力辨认起眼前不见五指的漆黑，同时努力让呼救声透过嘴里塞着的毛巾。
似乎有几缕微弱的光传来，来不及激动，为了适应黑暗而放大的瞳孔就猛地紧缩，
跟着一阵阵从脊背直冲天灵的寒意。

——那微光，来自无数双淡漠凝视你的眼！

---

记不清是第几次，又进入同一个梦魇了。

翊在办公室醒来，望着窗外的乌云出神——不知怎地，睡前关好的窗竟大开着，
下意识伸手去够桌上的水杯时也扑了个空。头依然疼得厉害，大概因为那件事，
最近精神过于紧绷了，等一切尘埃落定后，给自己一些放松的时间好了。

*** II

时钟指向下午三点整，敲门声响起。

「进来吧。」

一个黑色身影推门而入，径直走到翊的面前，低头看向桌对面的翊，神情里透着严肃。

「关于那件事情，你考虑得如何了？」黑影开门见山道。

「我不同意。」

来者是翊的大学同学兼这间公司的合伙人隆，平日里常四处奔走于公司的市场化业务，
如果不是因为他口中的“那件事”，想来不会在出现在此时此地。

「为什么呢？」隆似乎对翊的回答并不意外，「我们最新的技术突破领先业内，
正是借上市的东风抢占市场先机的绝佳机会。」

「现有的小范围场景下的数字模拟都需要大量进一步的测试观察，
新技术距离实际可用还有相当远的距离，也不是我们目前的算力能支持的。」

「不管是上线还是测试，都需要更多的资金，你也不希望看到自己的心血被埋没不是吗？
只要给投资人们做个演示让公司顺利上市，你说的这些都不会是问题。」

「……」

*** III

两人正进行的争论，围绕着公司的核心业务——数字脑——脑机时代新兴的技术，
通过特殊材料将人脑状态扫描存储下来，就能利用特质的计算设备模拟人脑活动。
这样的模拟大脑也可以接入脑机服务器运营的虚拟世界中与接入其中的真人交互，
数字脑的应用前景非常广泛：

在亲友弥留之际保存他们的大脑状态，通过脑机接入后，
客户可以在脑机服务器运行的虚拟世界中与模拟的亲友重聚；
虚拟世界的服务提供商们，只需将经过特定培训的员工们的大脑状态记录，
就可以批量实现媲美真人扮演的 NPC 角色；
一些更加大胆的人们甚至畅想通过这样的形式延长自己的生命！
然而这类应用仍面临伦理学方面的巨大争议。

抛开伦理学方面的争议，技术层面上，也限制了目前这样的模拟只能非常小的时空范围内实现。
即便如此，这样的模拟也常因为各种不可控因素崩溃，这时只能从崩溃之前最后的状态恢复，
这样的限制使得这项技术离真正好用还有一段距离。

沉默良久，翊再次开口：

「我想要对公司和技术完全的控制权，不管你怎么说，我都不会考虑上市。」

争执未果，隆一反常态地没有大发雷霆，淡淡留下一句「我会想另寻他法。」便转身离开。

*** IV

异常平静的隆却让翊更加轻松不起来。

/按照他的性格，这件事一定不会这么简单就结束。/

翊有些心烦意乱，打算到门外透透气。

拧开门的一瞬间，突然天旋地转。

---

翊有些心烦意乱，打算用工作转移自己的注意力。

翊将保存着核心技术的安全介质接入脑机，凭借着自己的肌肉记忆输入起密钥。
莫名地，他呆住了——肌肉“失忆”了——好像这段密钥从来没有被自己输入过。
他只好转而求助自己的大脑，隐隐作痛的头让他感到从记忆中提取信息异常困难，

/也许这也和最近发生的一连串怪事有关系？/

有些怀疑地敲下最后几位：

「7-@-5-$-」

已经做好错误准备的他，稍有些意外地，听到了检验通过的清脆提示音。

可一件令他感到更加奇怪的事情发生了，翊惊出一身冷汗，接着一阵目眩。

---

翊办公桌前的人输入了最后几位密钥：「7-@-5-$-」，响起的却是急促而刺耳的错误提示。
他摇了摇头，心里叹道： /还是不行吗？/

将这个错误的尝试记录在某个地方，他操作起脑机里名为 =翊-15:33.status= 的文件，
选择了 *恢复模拟* 。

*** V

「7-@-5-$」，翊有些怀疑敲下最后几位后，预期之中的错误提示响起，

#+begin_quote
*警告：* 密钥错误，将在 10 次失败尝试后抹除所有内容！
#+end_quote

……

翊输入完密钥的最后一位，短促的错误提示又一次响起，只剩最后三次机会。

翊有些不安，试了这么多次竟然都不对实在反常，反复确认安全介质没有被调换后，
他揉了揉头，更加细致地检索起记忆的每个角落……

随着又一次输入完成，万幸的是，清脆的声音响起，用完所有试错机会之前，终于成功了。

/发生了什么？介质里的内容怎么全部消失了？/

翊一边脑海闪过无数推测，一边镇定地去找用于恢复的备份，却渐渐感到呼吸困难。

---

清脆的声音响起，黑色的身影长舒一口气，还好在限制的次数之内解开了，
简单确认其中的内容，放下了悬着的一颗心。

/我知道说服不了你的，但你也知道我不会轻易罢休，对不起只能用这样特殊的方法了。/
/等这份内容得到投资人认可，公司成功上市后，你会感谢我的。/

隆插入自己的安全介质，开始拷贝刚刚解开的核心技术内容。

按耐不住兴奋的他全然没有意识到，自己的介质里空空如也。

隆开始感到意识模糊……

